{
    "author": {
        "name": "Ryan M"
    },
    "favicon": "https://ryanmo.co/images/favicon.png",
    "feed_url": "https://ryanmo.co/feeds/tag/applewatch.json",
    "home_page_url": "https://ryanmo.co",
    "items": [
        {
            "id": "https://ryanmo.co/2015/05/03/apple-watch-for-cycling",
            "url": "https://ryanmo.co/2015/05/03/apple-watch-for-cycling",
            "title": "Apple Watch for Cycling",
            "content_html": "<p>I ride with a <a href=\"https://buy.garmin.com/en-US/US/into-sports/cycling/edge-810/prod112912.html\">Garmin 810</a> with a cadence/speed sensor<sup id=\"fnref:1\"><a class=\"footnote-ref\" href=\"#fn:1\">1</a></sup>. I wanted to compare the Garmin to the Apple Watch for a bike ride.</p>\n\n<h2 id=\"first-impressions\">First Impressions</h2>\n<p>Starting the workout on the watch is nice. Two-three taps and you're starting a workout. What I didn't find ideal is that there wasn't a screen that gave you an overview of elapsed time, speed and distance all in one. There were individual pages for each section that you'd have to swipe through, which isn't very safe while riding a bike. I ended up leaving it on the heart rate monitor since the one I usually wear isn't working.</p>\n<h2 id=\"speed\">Speed</h2>\n<p>Speed was within 0.3 - 0.5 mph of the Garmin the entire time</p>\n<p><img alt=\"Apple_watch_cycling_00001\" src=\"https://ryanmo.co/posts/Tech/2015-05-03/Apple_watch_cycling_00001.jpg\" /></p>\n<p>(I know, I know. This was not safe to be taking this photo while moving.)</p>\n<h2 id=\"distance\">Distance</h2>\n<p>Distance was nearly spot on. I accidentally forgot to start my Garmin, so the watch was ahead by about 0.5 miles. By the end, it was still within the same range</p>\n<p><img alt=\"Apple_watch_cycling_00003\" src=\"https://ryanmo.co/posts/Tech/2015-05-03/Apple_watch_cycling_00003.jpg\" /></p>\n<p><img alt=\"Apple_watch_cycling_00004\" src=\"https://ryanmo.co/posts/Tech/2015-05-03/Apple_watch_cycling_00004.jpg\" /></p>\n<h2 id=\"time\">Time</h2>\n<p>This is the one area that I wasn't happy with on the watch. The watch does let you pause the ride, but it won't ever pause it automatically. If you stop for lunch, which I did, I had to manually pause the ride. I forgot to when I stopped to get an espresso along the way.</p>\n<p>My elapsed time (top-right on the Garmin) was the true amount of time I spend on the ride and time (top-left) is the time on the bike. With the watch, it all depends on whether you pause your ride or not</p>\n<p><img alt=\"Apple_watch_cycling_00005\" src=\"https://ryanmo.co/posts/Tech/2015-05-03/Apple_watch_cycling_00005.jpg\" /></p>\n<h2 id=\"battery\">Battery</h2>\n<p>Workouts destroy Watch's battery. By the end, Apple Watch was at 29%, while the Garmin was at 79% after around 3.5 hours.</p>\n<h2 id=\"location\">Location</h2>\n<p>I assume that Apple Watch is using GPS to calculate distance and speed. However, no where does it show you a map of where you went. Not a deal breaker, but it's fun to look back on your previous route, or be able to ride the same route again to improve your times.</p>\n<h2 id=\"siri\">Siri</h2>\n<p>I tried using Siri while riding. I don't know if I wasn't being loud enough or the road noise was making it difficult to hear me, but I couldn't get it to ever work. Plus needing your other hand for some actions makes using Apple Watch while riding nearly impossible (yes, I tried nose touching, but it wasn't great either).</p>\n<h2 id=\"the-finish\">The Finish</h2>\n<p>The ride summary on Apple Watch is very nice. It gives you a summary before you save the workout</p>\n<p><img alt=\"Apple_watch_cycling_00006\" src=\"https://ryanmo.co/posts/Tech/2015-05-03/Apple_watch_cycling_00006.png\" /></p>\n<p><img alt=\"Apple_watch_cycling_00007\" src=\"https://ryanmo.co/posts/Tech/2015-05-03/Apple_watch_cycling_00007.png\" /></p>\n<h2 id=\"final-thoughts\">Final Thoughts</h2>\n<p>If you don't want to invest in a dedicated cycling GPS, Apple Watch is a decent option, granted you don't go on rides over 5-6 hours. You won't get all the cool features, but if distance, speed and calories is all you care about, it's a pretty good option. I'll be sticking to my Garmin 810 for rides.</p>\n<p>Next will be to try out Strava, which will use the iPhone for the heavy lifting rather than the watch. </p>\n<p>[Update 2015-05-03 15:45 ] As <a href=\"https://twitter.com/ismh/status/594993860390051840\">@ismh points on out</a> Twitter, another good test would be the Garmin vs. the Apple Watch without the iPhone since I was basically comparing my iPhone GPS to Garmin's.</p>\n<div class=\"footnote\">\n<hr />\n<ol>\n<li id=\"fn:1\">\n<p>The speed sensor uses a magnet to measure speed based on wheel size rather than relying on GPS, which can be inaccurate.&#160;<a class=\"footnote-backref\" href=\"#fnref:1\" title=\"Jump back to footnote 1 in the text\">&#8617;</a></p>\n</li>\n</ol>\n</div>",
            "summary": "<p>I ride with a <a href=\"https://buy.garmin.com/en-US/US/into-sports/cycling/edge-810/prod112912.html\">Garmin 810</a> with a cadence/speed sensor<sup id=\"fnref:1\"><a class=\"footnote-ref\" href=\"#fn:1\">1</a></sup>. I wanted to compare the Garmin to the Apple Watch for a bike ride.</p>\n",
            "date_published": "2015-05-03T01:40:00-07:00",
            "author": {
                "name": "Ryan M",
                "url": "https://ryanmo.co/author/ryan-m.html"
            },
            "tags": [
                "cycling",
                "applewatch"
            ]
        }
    ],
    "title": "ryanmo.co",
    "version": "https://jsonfeed.org/version/1"
}